#! /bin/bash

[ $# -eq 1 ] && [ -d "$1" ] || exit 1

mess="$(find "$1" -mindepth 4 | egrep "^${1}/[[:alnum:]]+/[[:alnum:]]+/[[:alnum:]]+/[0-9]{4,4}[0-9]{2,2}[0-9]{2,2}[0-9]{2,2}[0-9]{2,2}[0-9]{2,2}\.txt$")"

[ -z "$(echo "$1" | egrep "^/")" ] || mess="$(echo "$mess" | cut -d "/" -f 2-)"

echo "$mess" | cut -d "/" -f 4 | sort | uniq -c | awk '{print $1 " " $2}' | sort -n -k 1,1 | tail -10


#Описаниеи
#find дава всичко, но искам само такива в които би имашо .txt файлове
#в случай че директорията започва с "/" за да работи нататък го махам
#извеждам с echo променливата mess и изрязвам само полет9о приятел от всички
#сортирам ги така че името на един приятел да се съсредочи едно след друго за да ползвам uniq
#uniq показва бр_редове име но се показват по особен начин и трябва да се минат с akw първо
#сортира се по първата колона, която дава броя на редовете
#сортирани са в 1-100-, затова вземам последните 10 реда

#Аргумент директория
#find -> logdir/protocol/acount/friend/...
#сортира се по / 4тото поле - тоест приятел
#cut - uniq и ще остане бр. редове приятел
